
###################################################################################################

int *a[10] : 一個 int 指標陣列包含 10 個元素，元素都是 int 指標

所以 a[0] ~ a[9] 其實記憶體位置是順序的 ex 0x00 += 16 字節 (pointer 是 16 字節 for 64 位元)
+------+------+------+------+------+------+------+------+------+------+------+
| a[0] | a[1] | a[2] | a[3] | a[4] | a[5] | a[6] | a[7] | a[8] | a[9] | ...  |
+------+------+------+------+------+------+------+------+------+------+------+
  |      |      |      |      |      |      |      |      |      |      |
  v      v      v      v      v      v      v      v      v      v      v
+------+------+------+------+------+------+------+------+------+------+------+
|  *   |  *   |  *   |  *   |  *   |  *   |  *   |  *   |  *   |  *   | ...  |
+------+------+------+------+------+------+------+------+------+------+------+

如果有以下函數，然後分別有 A 和 matrix 想要丟進函數裡面
void pointerToCharArray(char* str[]); // char* str[] 可以是 n*m，第一維不一定要是 1

char** A = (char**)calloc(2, sizeof(char*));
  	for(int i = 0; i < 2; i++) {
  		A[i] = (char*)calloc(5, sizeof(char));
  		sprintf(A[i], "%d, %d", i, i+1);
  	}

char matrix[2][20] = {
  		"{1, 2}",
  		"{2, 3}"
  	};


1. 第一種呼叫 pointerToCharArray(A)
char** 类型可以被隐式转换为 char*[] 类型，所以这是合法的。

2.第二種呼叫，pointerToCharArray(matrix) 會報錯，matrix[][] 並不能隱式轉換成 char* str[] 
matrix 的类型是 char[2][20]，并不能直接转换为 char*[] 类型

如果要使用 matrix 
char* arr[] = {matrix[0], matrix[1]};
pointerToCharArray(arr);
這樣才能成功

!!!!!!!!!!!!!!看一下記憶體排列!!!!!!!!!!!!!!
printf("%d\n", sizeof(int*));
printf("A[0]: %p\n", A[0]);
printf("A[0][0]: %p\n", A[0][0]); //完全跟 A[0] 無關了
printf("A[0][1]: %p\n", A[0][1]);
printf("A[1]: %p\n", A[1]); //和 A[0] 差了 4 Bytes
4
A[0]: 00E513F8
A[0][0]: 00000030
A[0][1]: 0000002C //放在 heap，記憶體位置是由大到小，跟書上說由小到大其實有點牴觸!?
A[1]: 00E51408 //0x408 - 0x3F8 = 16，乍一看好像沒有太多規則，如果說 A[0] A[1] 也是 heap 但他是從小到大

#所以可以看出 A 其實不是一整塊的，記憶體分布散落，

printf("strlen:%d\n", strlen(matrix[0])); //會印出 6
printf("matrix[0]: %p\n", &matrix[0]); 
printf("matrix[0][1]: %p\n", &matrix[0][1]); 
printf("matrix[1]: %p\n", &matrix[1]); // 和 matrix[0] 差 10 個 Bytes = 10 char 大小 
strlen:6
matrix[0]: 0061FEED
matrix[0][1]: 0061FEEE //放在 stack 記憶體位置由小到大
matrix[1]: 0061FEF7 //0xF7-0xED = 10

#matrix 就是一整塊

###################################################################################################

int (*a)[10] : 一個指標，指向一個 int 陣列，包含十個 int 元素
+------+
|   a  |
+------+
  |
  v
+------+------+------+------+------+------+------+------+------+------+------+
| a[0] | a[1] | a[2] | a[3] | a[4] | a[5] | a[6] | a[7] | a[8] | a[9] | ...  |
+------+------+------+------+------+------+------+------+------+------+------+

###################################################################################################

int** a : 